LineAndTextAttr.setupStyleAndFont(StyleSettings*,ElementId,System.UInt32!System.Runtime.CompilerServices.IsLong,System.Int32,ElementId,System.Boolean,AUnits!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,System.Double)
Creates category and corresponding GStyle if they don't exist or are owned by a different element.
If they are owned by a different element the input parameters for GStyle (defColor, defPenNumber, defLinePatternId) are ignored and taken from the existing GStyle
(it is used during a type duplication, when this method is called from postDocAdd method).
Creates font if it doesn't exist or is owned by a different element.
If it is owned by a different element the input parameters for font (font sizes) are ignored and taken from the existing font.